# Koşullu Eleman İşlemleri

In [1]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    26    10    23
1    25    29     4
2    27    16     2
3     9     5     2
4    13     7     7
5    15    11    27
6     3    22    23
7    22    28    24
8    29     7    25
9    12    19     9

In [2]:
df["var1"]

0    26
1    25
2    27
3     9
4    13
5    15
6     3
7    22
8    29
9    12
Name: var1, dtype: int64

In [8]:
df[0:2][["var1","var2"]]

   var1  var2
0    26    10
1    25    29

In [9]:
df

   var1  var2  var3
0    26    10    23
1    25    29     4
2    27    16     2
3     9     5     2
4    13     7     7
5    15    11    27
6     3    22    23
7    22    28    24
8    29     7    25
9    12    19     9

In [10]:
df.var1

0    26
1    25
2    27
3     9
4    13
5    15
6     3
7    22
8    29
9    12
Name: var1, dtype: int64

In [15]:
df[df.var1 > 15]

   var1  var2  var3
0    26    10    23
1    25    29     4
2    27    16     2
7    22    28    24
8    29     7    25

In [16]:
df[(df.var1 > 15) & (df.var3 < 5)]

   var1  var2  var3
1    25    29     4
2    27    16     2

In [18]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
0    26    10
1    25    29
2    27    16
7    22    28
8    29     7

In [20]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
0    26    10
1    25    29
2    27    16
7    22    28
8    29     7